eng_ukr_transliterate <- function(text) {
stringr::str_replace_all(text, c("Shch"="Щ", "shch"="щ", "Sh"="Ш", "sh"="ш", "Ts"="Ц", "ts"="ц",
                                   "Ch"="Ч", "ch"="ч", "Kh"="Х", "kh"="х", "Zh"="Ж", "zh"="ж",
                                   "Ye"="Є", "ye"="є", "Yi"="Ї", "yi"="ї", "Yu"="Ю", "yu"="ю",
                                   "Ya"="Я", "ya"="я", "A"="А", "a"="а", "B"="Б", "b"="б",
                                   "V"="В", "v"="в", "H"="Г", "h"="г", "G"="Ґ", "g"="ґ",
                                   "D"="Д", "d"="д", "E"="Е", "e"="е", "Z"="З", "z"="з",
                                   "Y"="И", "y"="и", "I"="І", "i"="і", "J"="Й", "j"="й",
                                   "K"="К", "k"="к", "L"="Л", "l"="л", "M"="М", "m"="м",
                                   "N"="Н", "n"="н", "O"="О", "o"="о", "P"="П", "p"="п",
                                   "R"="Р", "r"="р", "S"="С", "s"="с", "T"="Т", "t"="т",
                                   "U"="У", "u"="у", "F"="Ф", "f"="ф", "'"="ь",
                                   "Q"="К", "q"="к", "W"="В", "w"="в", "X"="Кс", "x"="кс",
                                   "C"="К", "c"="к"))
}
